{
  "Event": {
    "Date": "21-04-2018"
  },
  "Location": {
    "Name": "Auckland",
    "Latitude": 36.844806,
    "Longitude": 174.766247,
    "Address": "Cliftons, 45 Queen Street, Auckland, NZ"
  },
  "Social": {
    //"Meetup": "https://global.azurebootcamp.net/",
    "GAB": "https://auckland.azurebootcamp.net/",
    "Facebook": "https://www.facebook.com/globalazure",
    "Twitter":  "https://twitter.com/hashtag/GlobalAzure"
  },
  "Callout": {
    "Text": "Click Here to Reserve Your Place Today!",
    "Link": "https://aka.ms/AzureBootcampAKL18",
    "Type": "default"
  },
  "Organizers": [
    {
      "Name": "Nick Westbrook - Auckland Microsoft Cloud User Group",
      "Social": {
        "Twitter": "https://www.twitter.com/nickwestbrook",
        "LinkedIn": "https://www.linkedin.com/in/nickwestbrook",
        "Website": "https://secure.meetup.com/messages/?new_convo=true&member_id=118434052&name=Nick+Westbrook"
      }
    },
    {
      "Name": "Rory Braybrook - North Shore .net User Group",
      "Social": {
        "Twitter": "http://www.twitter.com/rbrayb",
        "LinkedIn": "https://www.linkedin.com/in/rory-braybrook-6050a521/",
        "Website": "http://northshore.netusergroup.org.nz/"
      }
    }
  ],
  "Sponsors": [
    {

    }
  ],
  "Prizes": [
    {
      "ImageUrl": "/images/AzurePass.jpg",
      "Link": "#",
      "Name": "$300 in Azure Credit"
    },
    {
      "ImageUrl": "/images/AzureLogo.png",
      "Link": "#",
      "Name": "T-shirts, stickers and more!"
    }
  ],

  "Tracks": [
    {
      "Name": "Developer Track",
      "Sessions": [
        {
          "SessionId": "Common1",
          "Time": "9:00 AM - 10.00 AM",
          "Title": "REGISTRATION / WELCOME / SETUP"
        },

        {
          "SessionId": "DEV1",
          "Time": "10:00 AM - 11:30 AM",
          "Title": "Is That Appropriate?",
          "Room": "Do you allow visitors to your web site or internal collaboration sites upload images and post messages for others read?  How do you know the content is appropriate and will not cause offence to others to break polices or terms and conditions of use? In this session, you will learn how to use one of Microsoft's new AI tools to moderate content that you can integrate with your solution using Logic Apps to process content.  You will leave the session with an end-to-end solution for evaluating the content of images through the Cognitive Services API using a Logic App to connect to a wide range of data sources, even your personal OneDrive.",
          "Speaker": {
            "Name": "Alan Marshall",
            "Organization": "Microsoft MVP / Provoke Solutions",
            "Description": "As a senior consultant at Provoke, Alan works with many organisations on architecting solutions that leverage Office 365 and Azure services to build solutions that address business needs or strategic initiatives.  He facilitate workshops to formulate ideas and translate these into possible solutions leveraging Azure services primarily in the AI space in the last 2 years.",
            "ImageUrl": "/images/AlanMarshall.jpg",
            "Social": {
              "Twitter": "http://www.twitter.com/pomealan",
              "LinkedIn": "https://www.linkedin.com/in/alan-marshall-2679803"
            }
          }
        },

        {
          "SessionId": "Common2",
          "Time": "11:00 AM - 11:30 AM",
          "Title": "Morning tea - interspersed with lab."
        },

        {
          "SessionId": "DEV2",
          "Time": "11:30 AM - 01:00 PM",
          "Title": "A Lap Around Azure AD for Developers",
          "Room": "In this session we'll look at the main features of Azure AD and how they fit together. We'll cover the different protocols and when to use which. We will look at the differences between web and native devices and how ADAL / MSAL fits into the picture. The lab session will give attendees a chance to hook up an application with Azure AD so that users can successfully authenticate. Attendees can choose between mobile / desktop / web / SPA / web API and service to service. We'll also look at 'Easy Auth' – a no code offering. Visual Studio (preferably 2017) is required.",
          "Speaker": {
            "Name": "Rory Braybrook",
            "Organization": "Datacom",
            "Description": "Rory is an architect at Datacom NZ working in the Microsoft Identity space delivering systems based on the Microsoft Identity stack.",
            "ImageUrl": "/images/RoryBraybrook.jpg",
            "Social": {
              "Twitter": "http://www.twitter.com/rbrayb",
              "Website": "https://medium.com/the-new-control-plane",
              "LinkedIn": "https://www.linkedin.com/in/rory-braybrook-6050a521/"
            }
          }
        },

        {
          "SessionId": "Common3",
          "Time": "01:00 PM - 1:30 PM",
          "Title": "LUNCH"
        },

        {
          "SessionId": "DEV3",
          "Time": "1:30 PM - 3:00 PM",
          "Title": "Serverless and Containerised Microservices Architectures on Azure",
          "Room": "This session will warm up with a discussion covering some key concepts, literature and history around serverless and microservices architecture (including containerisation). Opinions on appropriate – and inappropriate – use-cases for these architectures will be ventured. We’ll look at common hosting patterns and hosting options, including Windows Azure. The majority of the session will be workshop oriented – we’ll step through the process of getting a simple microservices application running on Docker on your local machine and deployed on to Azure managed Kubernetes Service (AKS).",
          "Speaker": {
            "Name": "Bernard O'Leary",
            "Organization": "Provoke Solutions",
            "Description": "Bernard is a solutions architect at Provoke Solutions, boasting a depth of experience in a broad range of areas. With core skill sets in both Microsoft custom software development, and open source development, his range of commercial experience give him the advantage of understanding technology across the board. With vast experience in agile methodologies, Bernard brings a unique combination of technical understanding and the ability to facilitate teams to brainstorm solutions collaboratively. His expertise in solution architecture allows him to clarify ideas into high quality technical solutions.",
            "ImageUrl": "/images/BernardOLeary.jpg",
            "Social": {
              "Twitter": "http://www.twitter.com/bernardoleary",
              "LinkedIn": "https://www.linkedin.com/in/bernardoleary/"
            }
          }
        },

        {
          "SessionId": "Common4",
          "Time": "2:30 PM - 3:00 PM",
          "Title": "Afternoon tea - interspersed with lab."
        },


        {
          "SessionId": "DEV4",
          "Time": "3:00 PM - 4:30 PM",
          "Title": "Build and Deploy a Web API using Azure Functions and CosmosDB",
          "Room": "This session will cover an introduction to Functions-As-A-Service offerings in Azure. We will take you through quickly building and deploying a web API using Azure Functions and CosmosDB and also give a quick demo on Event Driven Architecture with Functions and Azure Service Bus.",
          "Speaker": {
            "Name": "William Wang",
            "Organization": "IAG NZ",
            "Description": "William is a software developer at IAG New Zealand and has over 9 years experience developing web and WinForms based applications including Enterprise-level .net applications.",
            "ImageUrl": "/images/WilliamWang.jpg",
            "Social": {

            }
          }
        },

        {
          "SessionId": "Common5",
          "Time": "4:30 PM - 5:00 PM",
          "Title": "WRAP-UP + GIVEAWAYS"
        }
      ]
    },

    {
      "Name": "IT Pro Track",
      "Sessions": [
        {
          "SessionId": "Common1",
          "Time": "9:00 AM - 10.00 AM",
          "Title": "REGISTRATION / WELCOME / SETUP"
        },

        {
          "SessionId": "ITPRO1",
          "Time": "10:00 AM - 11:30 AM",
          "Title": "A Practical Guide to Azure Administration",
          "Room": "While it's super easy for anyone to build services in Azure, the number of resources can quickly get out of hand. What are they for? Who's looking after them? Do they pose a security threat? Are you wasting money having them running? In this session we'll take a look at some of the ways Azure helps us keep things in check including tags, policy, RBAC, Security Center, Azure Monitor, Cost Management and more. Your boss will love you for it!",
          "Speaker": {
            "Name": "Nick Westbrook",
            "Organization": "Microsoft MVP / Provoke Solutions",
            "Description": "Nick is a Microsoft Azure MVP and lead cloud infrastructure engineer at Provoke Solutions in Auckland. He has 17 years experience in helping businesses derive benefit from Microsoft technologies and enjoys sharing his learnings with the community through his co-leadership of the Auckland Microsoft Cloud User Group. ",
            "ImageUrl": "/images/NickWestbrook.jpg",
            "Social": {
              "Twitter": "http://www.twitter.com/nickwestbrook",
              "Website": "http://www.nickwestbrook.net",
              "LinkedIn": "http://www.linkedin.com/in/nickwestbrook"
            }
          }
        },

        {
          "SessionId": "Common2",
          "Time": "11:00 AM - 11:30 AM",
          "Title": "Morning tea - interspersed with lab."
        },

        {
          "SessionId": "ITPRO2",
          "Time": "11:30 AM - 01:00 PM",
          "Title": "Wandering into Azure via Scripts and Automation",
          "Room": "A quick drive by of 4, ok, 5 PowerPoint slides, we will quickly get into scripting and be deploying our highly available and redundant Azure platform that would host a public facing website. Through the hands-on workshop, we will look at some basics of writing ARM scripts, tools to write and deploy them and why not dabble a  touch of DevOps, we will even check out some basics of GitHub for automated deployment.",
          "Speaker": {
            "Name": "Aben Samuel",
            "Organization": "Equinox IT",
            "Description": "Aben is a cloud solutions architect with an established track record of over 10 years of experience in helping organisations to efficiently use their networks and other systems. Ensuring that the design of an organisations IT platform allows all of the components, including computers, the network, software and people, to fit together and work properly.",
            "ImageUrl": "/images/AbenSamuel.jpg",
            "Social": {
              "Twitter": "http://www.twitter.com/neop26",
              "Website": "http://www.wellytonian.com",
              "LinkedIn": "https://www.linkedin.com/in/abensamuel/"
            }
          }
        },

        {
          "SessionId": "Common3",
          "Time": "01:00 PM - 1:30 PM",
          "Title": "LUNCH"
        },

        {
          "SessionId": "ITPRO3",
          "Time": "1:30 PM - 3:00 PM",
          "Title": "Containerize Your World using Azure Container Services",
          "Room": "This session will show you how to get started with Azure Container Service (ACS), one of the most powerful ways of running containerized applications in Azure. You'll learn how to set up a Kubernetes cluster using the Azure Cloud Shell and deploy a highly available and scalable web application with only a few commands. We'll then show how easy it is to scale up, reconfigure or update your application without any incurring any downtime to users.",
          "Speaker": {
            "Name": "Daniel Scott-Raynsford",
            "Organization": "Microsoft MVP / IAG NZ",
            "Description": "Daniel has spent 16 years as a software developer, but always had a lot of love for the infrastructure that kept his services running. Through combining the power and flexibility of cloud computing and modern DevOps and development practices he has seen what can really be achieved. His passion is to share these modern principals and techniques with IT pros and developers alike – and to automate everything he can with PowerShell.",
            "ImageUrl": "/images/DanScottRaynsford.jpg",
            "Social": {
              "Twitter": "http://www.twitter.com/dscottraynsford",
              "Website": "https://dscottraynsford.wordpress.com",
              "LinkedIn": "https://www.linkedin.com/in/dscottraynsford"
            }
          }
        },

        {
          "SessionId": "Common4",
          "Time": "2:30 PM - 3:00 PM",
          "Title": "Afternoon tea - interspersed with lab."
        },

        {
          "SessionId": "ITPRO4",
          "Time": "3:00 PM - 4:30 PM",
          "Title": "Replicate, Backup & Migrate in Azure",
          "Room": "In this session we will take a look into the ways you can leverage Azure Site Recovery Service, Azure Backup and other Azure services when tasked with addressing Business Continuity, Disaster Recovery & even VM migration for your organisation.",
          "Speaker": {
            "Name": "Buddy Davies",
            "Organization": "Provoke Solutions",
            "Description": "Buddy is a senior cloud engineer at Provoke in Auckland and spends his days architecting and building Azure infrastructure for some of NZ's most well-known companies as well as helping them migrate current systems to the cloud. He also has a keen interest in DevOps practices and enjoys leveraging automation to improve process efficiencies.",
            "ImageUrl": "/images/BuddyDavies.jpg",
            "Social": {
              "Twitter": "http://www.twitter.com/buddydavies",
              "LinkedIn": "https://www.linkedin.com/in/buddy-davies-72437352/"
            }
          }
        },

        {
          "SessionId": "Common5",
          "Time": "4:30 PM - 5:00 PM",
          "Title": "WRAP-UP + GIVEAWAYS"
        }
      ]
    }


    

  ]
}